---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter
source: html/4f1e4cab-1fe5-1b8c-a010-fcfc6d3995d4.htm
---
# StructuralMaterialTypeFilter Methods

Applies the filter to a given element.